app/controllers/backend/material_management/purchase_orders_controller.rb

  def index
		@title = "Ordenes de compra"
    @purchase_orders = Material::PurchaseOrder.all
---
SELECT * FROM "material_purchase_orders"

  def show
		@title = "Ordenes de compra / Detalle de orden"
    @purchase_order = Material::PurchaseOrder.find(params[:id])
---
SELECT * FROM "material_purchase_orders" WHERE ("material_purchase_orders"."id" = 2)

  def create
    @purchase_order = Material::PurchaseOrder.new(params[:material_purchase_order])
		default

		@success = @purchase_order.valid?
		@success &= @purchase_order.has_added_item_positions?(current_purchase_order_positions_objects)

		if @success
			@purchase_order.save
---
INSERT INTO "material_purchase_order_positions" ("updated_at", "total_amount", "material_order_measure_unit_id", "delivery_date", "sub_total", "taxable", "material_raw_material_id", "created_at", "total", "tax_amount", "quantity", "tax_id", "material_purchase_order_id") VALUES('2015-08-27 14:53:24.460798', NULL, 1, '2015-08-28', 1200.0, NULL, 71, '2015-08-27 14:53:24.460798', 14400.0, NULL, 12.0, 3, 2) RETURNING "id"
INSERT INTO "material_purchase_orders" ("updated_at", "currency_type_id", "delivery_date", "create_by_id", "posting_date", "supplier_id", "created_at") VALUES('2015-08-27 14:53:24.190136', 1, NULL, 1, '2015-08-27', 18, '2015-08-27 14:53:24.190136') RETURNING "id"

	def get_quotation_requisition_supplier
		current_purchase_order_positions_clear
		@suppplier = Supplier.find_by_id(params[:material_purchase_order][:supplier_id])
---
SELECT * FROM "suppliers" WHERE ("suppliers"."id" = E'18') LIMIT 1