app/controllers/backend/financial_management/incoming_invoices_controller.rb

SELECT * FROM "account_payable_incoming_invoices" WHERE ("account_payable_incoming_invoices".material_purchase_order_id = 1) LIMIT 1
---
	def set_incoming_invoice_document
		@incoming_invoice_document_type = AccountPayable::IncomingInvoiceDocumentType.find_by_id(params[:account_payable_incoming_invoice][:account_payable_incoming_invoice_document_type_id])

INSERT INTO "account_payable_incoming_invoices" ("control_number", "tax", "total_amount", "updated_at", "legal_contractual_voluntary_obligation", "tax_exempt", "amount_general", "amount_reduced", "currency_type_id", "tenderer_id", "retained_amount", "amount_additional", "create_by_id", "posting_date", "invoice_date", "balance", "municipal_tax", "created_at", "associated_purchase_ledgers", "supplier_id", "account_payable_incoming_invoice_document_type_id", "tenderer_type", "reference", "description", "sub_total_amount", "tax_amount", "tax_amount_general", "amount_exempt", "no_deductible", "tax_amount_additional", "purchase_ledger_period", "material_purchase_order_id", "tax_amount_reduced", "amount_total_to_paid") VALUES(E'23', 12.0, 18368.0, '2015-08-27 14:53:46.431495', 'f', 'f', 16400.0, 0.0, 1, 18, 0.0, 0.0, 1, '2015-08-27', E'2015-08-15', 0.0, 'f', '2015-08-27 14:53:46.431495', 't', 18, 2, E'Supplier', E'123', E'dsdsdsd', 16400.0, NULL, 1968.0, 0.0, 'f', 0.0, E'2015-08', 2, 0.0, 18368.0) RETURNING "id"
UPDATE "account_payable_incoming_invoices" SET "created_at" = '2015-08-27 14:53:46.431495', "updated_at" = '2015-08-27 14:53:46.547061', "purchase_ledger_period" = E'2015-08', "tenderer_type" = E'Supplier', "invoice_date" = E'2015-08-15', "tax" = 12.0, "tax_amount_general" = 1968.0, "balance" = 18368.0, "create_by_id" = 1, "currency_type_id" = 1, "control_number" = E'23', "amount_total_to_paid" = 18368.0, "account_payable_incoming_invoice_document_type_id" = 2, "sub_total_amount" = 16400.0, "description" = E'dsdsdsd', "material_purchase_order_id" = 2, "supplier_id" = 18, "total_amount" = 18368.0, "reference" = E'123', "posting_date" = '2015-08-27', "tenderer_id" = 18, "amount_general" = 16400.0 WHERE "id" = 59
SELECT * FROM "supplier_withholding_taxes" WHERE ("supplier_withholding_taxes".supplier_id = 18)
SELECT * FROM "suppliers" WHERE ("suppliers"."id" = 18)
---
  def create
    @incoming_invoice = AccountPayable::IncomingInvoice.new(params[:account_payable_incoming_invoice])
		default
		@success = @incoming_invoice.valid?
		@success &= @incoming_invoice.has_added_item_positions?(current_incoming_invoice_positions_objects)

		if @success
			@incoming_invoice.save
			current_incoming_invoice_positions_objects.each do |current_incoming_invoice_position|
				current_incoming_invoice_position.account_payable_incoming_invoice = @incoming_invoice
				current_incoming_invoice_position.save
			end
			@incoming_invoice.supplier.supplier_withholding_taxes.each do |supplier_withholding_tax|

SELECT * FROM "material_purchase_orders" WHERE ("material_purchase_orders"."id" = E'000001') LIMIT 1
SELECT * FROM "material_purchase_order_positions" WHERE ("material_purchase_order_positions".material_purchase_order_id = 2)
---
	def confirm_purchase_order
		current_incoming_invoice_positions_clear
    @incoming_invoice = AccountPayable::IncomingInvoice.new
		@purcharse_order = Material::PurchaseOrder.find_by_id(params[:purchase_order_id])
    @success = true
		if @purcharse_order
      if @purcharse_order.account_payable_incoming_invoice
        @errors = ["Orden #{params[:purchase_order_id]} ya se encuentra contabilizado!"]
        @success = false
      else
        @purcharse_order.material_purchase_order_positions.each do |purchase_order_position|